//------------------------------------------------------------------
// 版权声明：本程序模块属于金证微内核架构平台(KMAP)的一部分
//           金证科技股份有限公司  版权所有
//
// 文件名称：xsdk_timediff.h
// 模块名称：时间差值计算类
// 模块描述：本模块提供获取当前时间与基准时间时间差的方法，精确到微妙
//
// 开发作者：钟兆斌
// 创建日期：2012-04-11
// 模块版本：1.0.000.000
//-------------------------------------------------------------------
// 修改日期      版本              作者            备注
//-------------------------------------------------------------------
// 2012-04-11  1.0.000.000        钟兆斌          原创
//-------------------------------------------------------------------
#if !defined(__XSDK_TIMESPACE_H__)
#define __XSDK_TIMESPACE_H__

#include "xsdk_define.h"

BGN_NAMESPACE_XSDK

#ifdef __cplusplus
extern "C"
{
#endif



//--------------------------------------------------------------------
//   类名称：CTimeDiff
// 简要描述：该类提供对时间差值的获取方法
//--------------------------------------------------------------------
class CTimeDiff
{
public:
  CTimeDiff();
  ~CTimeDiff();

  //--------------------------------------------------------------------------------
  // 函数名称：CTimeDiff::SetBaseTime
  // 简要描述：设置基准时间
  //
  // 其他说明：
  // 入参说明：
  // 返回结果：int   调用结果
  //                  0   存在
  //                  -1  不存在
  //--------------------------------------------------------------------------------
  int SetBaseTime(void);

  //--------------------------------------------------------------------------------
  // 函数名称：CTimeDiff::GetBaseTime
  // 简要描述：获取基准时间
  //
  // 其他说明：
  // 入参说明：
  // 返回结果：int   基点时间
  //--------------------------------------------------------------------------------
  __int64 GetBaseTime(void);

  //--------------------------------------------------------------------------------
  // 函数名称：CTimeDiff::GetTimestamp
  // 简要描述：获取当前时间与基准时间的差值
  //
  // 其他说明：
  // 入参说明：[out]  __int64 &p_iTimeSpace  无   从basetime到调用该方法时的时间间隔（单位：微秒）
  // 返回结果：int   时间间隔
  //--------------------------------------------------------------------------------
  __int64 GetTimeDiff(__int64 &p_llTimeSpace);

private:
  __int64 m_llBaseTime;
  __int64 GetNowTime(void);
};

#ifdef __cplusplus
}
#endif  //__cplusplus

END_NAMESPACE_XSDK

#endif  //__XSDK_TIMESPACE_H__
